# YOLO-GRL 🚀
# Enhanced YOLO11 variant comprehensively featuring the GhostRepLite (GRL) module.

# Parameters
nc: 80 # number of classes
scales: 
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] 
  s: [0.50, 0.50, 1024] 
  m: [0.50, 1.00, 512]  
  l: [1.00, 1.00, 512]  
  x: [1.00, 1.50, 512]  

# YOLO-GRL Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, GhostRepLite, [256, 0.4]] # 2-P2/4: Lightweight GRL module for efficient early feature extraction
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, GhostRepLite, [512, 0.4]] # 4-P3/8: GRL module minimizing spatial reduction cost
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, GhostRepLite, [512, 0.4]] # 6-P4/16: GRL module for deep semantic processing
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, GhostRepLite, [1024, 0.4]] # 8-P5/32: GRL module at the deepest spatial level
  - [-1, 1, SPPF, [1024, 5]]   # 9: Spatial Pyramid Pooling - Fast
  - [-1, 2, C2PSA, [1024]]     # 10: C2PSA retained for spatial channel attention

# YOLO-GRL Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 2, GhostRepLite, [512, 0.4]] # 13: GRL module for efficient top-down feature fusion

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 2, GhostRepLite, [256, 0.4]] # 16: P3/8-small (Optimized by GRL)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, GhostRepLite, [512, 0.4]] # 19: P4/16-medium (Optimized by GRL)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, GhostRepLite, [1024, 0.4]] # 22: P5/32-large (Optimized by GRL)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)