# YOLO-DPCT 🚀
# Enhanced YOLO11 variant featuring the DualPath_CNNTransformer (DPCT) module.

# Parameters
nc: 80 # number of classes
scales: 
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] 
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512] 
  x: [1.00, 1.50, 512] 

# YOLO-DPCT Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C3k2, [256, False, 0.25]] # 2-P2/4: Maintain depth for robust early feature extraction
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4-P3/8: Moderate depth adjustment to minimize high-level GFLOPs
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, DualPath_CNNTransformer, [640, 0.5, True]] # 6-P4/16: Inject DPCT module to bridge local and global context (width fixed at 640)
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, DualPath_CNNTransformer, [1024, 0.5, True]] # 8-P5/32: Deep DPCT module with channels restricted from 1280 to 1024 to constrain GFLOPs
  - [-1, 1, SPPF, [1024, 5]]   # 9: Spatial Pyramid Pooling - Fast
  - [-1, 2, C2f, [1024]]       # 10: Replace C2PSA with C2f for accelerated computation and significantly reduced FLOPs

# YOLO Standard Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 13: Adjust head channel matching

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 16: P3/8-small

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 19: P4/16-medium

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 22: P5/32-large

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)