# ==============================================================================
# YOLO-GTGP Ablation: GRL-Only Architecture
# Description: Proposed GhostRepLite (GRL) is utilized, while deep layers 
#              revert to standard YOLO11 C3k2 blocks for ablation comparison.
# ==============================================================================

# Parameters
nc: 4 # Number of classes
scales: 
  # [depth_multiple, width_multiple, max_channels]
  n: [0.50, 0.25, 1024] 

# YOLO-GTGP Backbone
# Objective: Extract multi-scale features from complex GPR B-scan profiles.
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2: Initial spatial downsampling
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  
  # Injecting GhostRepLite (GRL) for lightweight & efficient local feature extraction
  - [-1, 2, GhostRepLite, [256, 0.5]] 
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, GhostRepLite, [512, 0.5]] 
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  
  # Reverting DPCT to standard YOLO11 C3k2 block for ablation
  - [-1, 2, C3k2, [512, True]] 
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]] 
  
  - [-1, 1, SPPF, [1024, 5]] # 9: Spatial Pyramid Pooling Fast
  - [-1, 2, C2PSA, [1024]]   # 10: PSA Attention block for deep semantic enhancement

# YOLO-GTGP Head (Path Aggregation Network)
# Objective: Fuse high-level semantic features with low-level spatial details.
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # Cat backbone P4
  - [-1, 2, GhostRepLite, [512, 0.5]] # 13: Feature fusion using GRL

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # Cat backbone P3
  - [-1, 2, GhostRepLite, [256, 0.5]] # 16: Feature fusion using GRL (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # Cat head P4
  - [-1, 2, GhostRepLite, [512, 0.5]] # 19: Feature fusion using GRL (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # Cat head P5
  - [-1, 2, GhostRepLite, [1024, 0.5]] # 22: Feature fusion using GRL (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)